zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/Wireless/KW/KW47Z420B3/drivers/romapi/fsl_romapi.c
/*
 * Copyright 2021,2024-2026 NXP
 *  
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_flash_api.h"
#include "fsl_lpspi_flash.h"
#include "fsl_kb_api.h"
#include "fsl_nboot.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "driver.romapi"
#endif

/*
 *!@brief Structure of version property.
 *
 *!@ingroup bl_core
 */
typedef union StandardVersion
{
    struct
    {
        uint32_t bugfix : 8; /*!< bugfix version [7:0] */
        uint32_t minor : 8;  /*!< minor version [15:8] */
        uint32_t major : 8;  /*!< major version [23:16] */
        uint32_t name : 8;   /*!< name [31:24] */
    } bitfield;
    uint32_t version; /*!< combined version numbers. */
} standard_version_t;

/*!
 * @brief Root of the bootloader API tree.
 *
 * An instance of this struct resides in read-only memory in the bootloader. It
 * provides a user application access to APIs exported by the bootloader.
 *
 * @note The order of existing fields must not be changed.
 */
typedef struct BootloaderTree
{
    void (*runBootloader)(void *arg);                       /*!< Function to start the bootloader executing.*/
    const flash_driver_interface_t *flashDriver;            /*!< Internal Flash driver API.*/
    const kb_interface_t *kbApi;                            /*!< Bootloader API.*/
    const nboot_interface_t *nbootAuthenticate;             /*!< Image authentication API.*/
    const lpspi_flash_driver_interface_t *lpspiFlashDriver; /*!< Internal Flash driver API.*/
    standard_version_t version;                             /*!< Bootloader version number.*/
    const char *copyright;                                  /*!< Copyright string.*/
    uint32_t reserved0;                                     /*!< Reserved for factory use.*/
} bootloader_tree_t;

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
static status_t flash_check_param(
    flash_config_t *config, FMU_Type *base, uint32_t start, uint32_t lengthInBytes, uint32_t alignmentBaseline);

/*******************************************************************************
 * Variables
 ******************************************************************************/
#define BOOTLOADER_API_TREE_POINTER ((bootloader_tree_t *)0x14816800U)

/*******************************************************************************
 * Code
 ******************************************************************************/

/******************************************************
 * Flash driver
 ******************************************************/
/*!
 * @brief Initializes the global flash properties structure members.
 *
 * This function checks and initializes the Flash module for the other Flash APIs.
 */
status_t FLASH_Init(flash_config_t *config)
{
    assert(NULL != BOOTLOADER_API_TREE_POINTER);
    assert(NULL != config);

    status_t status;
    status = BOOTLOADER_API_TREE_POINTER->flashDriver->flash_init(config);

    return status;
}

/*!
 * @brief Erases the Dflash sectors encompassed by parameters passed into function.
 */
status_t FLASH_Erase(flash_config_t *config, FMU_Type *base, uint32_t start, uint32_t lengthInBytes, uint32_t key)
{
    assert(NULL != BOOTLOADER_API_TREE_POINTER);
    assert(NULL != config);
    assert(NULL != base);

    /* Clear flash cache before every erase to prevent the possibility of returning stale data */
    MCM->CPCR2 |= MCM_CPCR2_CCBC_MASK;

    status_t status;
    status = BOOTLOADER_API_TREE_POINTER->flashDriver->flash_erase_sector(config, base, start, lengthInBytes, key);

    return status;
}

/*!
 * @brief Programs flash phrases with data at locations passed in through parameters.
 */
status_t FLASH_Program(flash_config_t *config, FMU_Type *base, uint32_t start, uint32_t *src, uint32_t lengthInBytes)
{
    assert(NULL != BOOTLOADER_API_TREE_POINTER);
    assert(NULL != config);
    assert(NULL != base);
    assert(NULL != src);

    status_t status = kStatus_Fail;

    status = flash_check_param(config, base, start, lengthInBytes, FSL_FEATURE_FLASH_PFLASH_PHRASE_SIZE);
    if (status == kStatus_FLASH_Success)
    {
        /* Clear flash cache before every erase to prevent the possibility of returning stale data */
        MCM->CPCR2 |= MCM_CPCR2_CCBC_MASK;
        /* Align length to whole phrase */
        uint32_t alignedLength = ALIGN_DOWN(lengthInBytes, sizeof(uint8_t) * FSL_FEATURE_FLASH_PFLASH_PHRASE_SIZE);
        uint32_t extraBytes    = lengthInBytes - alignedLength;
        uint32_t *srcWord      = (uint32_t *)(uintptr_t)src;

        if (alignedLength > 0U)
        {
            uint32_t endAddress = start + alignedLength - 1U;
            while (start <= endAddress)
            {
                status = BOOTLOADER_API_TREE_POINTER->flashDriver->flash_program_phrase(
                    config, base, start, srcWord, FSL_FEATURE_FLASH_PFLASH_PHRASE_SIZE);
                if (kStatus_FLASH_Success != status)
                {
                    break;
                }
                else
                {
                    /* Increment to the next phrase */
                    start += FSL_FEATURE_FLASH_PFLASH_PHRASE_SIZE;
                    srcWord += 4U;
                }
            }
        }
        else
        {
            ; /* Do nothing */
        }

        if ((kStatus_FLASH_Success == status) && (extraBytes > 0U))
        {
            uint32_t extraData[4] = {0xFFFFFFFFu, 0xFFFFFFFFu, 0xFFFFFFFFu, 0xFFFFFFFFu};

            /* Copy extra bytes to phrase buffer */
            union
            {
                uint32_t *src;
                const void *srcVoid;
            } srcPtr;
            srcPtr.src = srcWord;

            union
            {
                uint32_t *xData;
                void *xDataVoid;
            } xDataPtr;
            xDataPtr.xData = (uint32_t *)&extraData[0];

